app/Http/Controllers/AuthController.php

    public function storeUser(Request $request)
    {

        $newUser = new User();
        $newUser->firstName = $request->firstName;
        $newUser->lastName = $request->firstName;
        $newUser->email = $request->email;
        $newUser->phoneNumber = $request->phoneNumber;
        $newUser->password = $request->password;

        $newUser->save();
---
insert into `users` (`firstName`, `lastName`, `email`, `phoneNumber`, `password`, `updated_at`, `created_at`) values ('Reed', 'Reed', 'mono@mailinator.com', '3', '$2y$12$Yw2GHCLVv6/2yiFZNHGSn./ZJ1Rx2rqx/S/eoo.KWpOaoBl35n7yu', '2023-12-02 16:39:49', '2023-12-02 16:39:49')