app/Http/Controllers/ClientController.php

    public function index()
    {
        $evenements = Evenement::where('est_cloture_ou_pas', 'pas cloture')->get();
---
select * from `evenements` where `est_cloture_ou_pas` = 'pas cloture'

    public function storeReservation(Request $request)
    {
        $reservation = new Reservation();
        $reservation->user_id = Auth::guard('web')->user()->id;
        $reservation->nombre_de_personne = $request->nombre_de_personne;
        $reservation->evenement_id = $request->evenement_id;
        $reservation->save();
---
insert into `reservations` (`user_id`, `nombre_de_personne`, `evenement_id`, `updated_at`, `created_at`) values (2, '23', '5', '2023-11-30 11:22:34', '2023-11-30 11:22:34')