app/Http/Controllers/EvenementController.php

select * from `evenements`
---
    public function index()
    {
        $evenements = Evenement::all();