app/Http/Controllers/EvenementController.php

    public function index()
    {
        $evenements = Evenement::where('association_id', Auth::guard('association')->user()->id)->get();
---
select * from `evenements` where `association_id` = 2

    public function store(Request $request)
    {

        $fileName = time() . "." . $request->file('path_image')->extension();

        $image = $request->path_image->storeAs(
            'photo_evenements',
            $fileName,
            'public'
        );

        DB::table('evenements')->insert([
            "libelle" => $request->libelle,
            "date_limite_inscription" => $request->date_limite_inscription,
            "description" => $request->description,
            "path_image" => $image,
            "est_cloture_ou_pas" => $request->est_cloture_ou_pas,
            "date_evenement" => $request->date_evenement,
            "association_id" => Auth::guard('association')->user()->id,
        ]);
---
insert into `evenements` (`libelle`, `date_limite_inscription`, `description`, `path_image`, `est_cloture_ou_pas`, `date_evenement`, `association_id`) values ('Assumenda consequat', '1988-05-08', 'Voluptatem et consec', 'photo_evenements/1701523175.jpg', 'pas cloture', '2022-11-09', 2)

    public function destroy(Evenement $evenement)
    {
        $evenement->delete();
---
delete from `evenements` where `id` = 10