app/Http/Controllers/ReservationController.php

select * from `reservations`
---
    public function index()
    {
        $reservations = Reservation::All();

update `reservations` set `est_accepte_ou_pas` = 'accepte', `reservations`.`updated_at` = '2023-12-02 11:25:52' where `id` = 7
---
    public function update(Reservation $reservation,string $etat)
    {
        $reservation->est_accepte_ou_pas = $etat;
        $reservation->save();